app/controllers/students_controller.rb

  def index
    # Integrate a controller action for handling the index action
    # Index action call the Student model and pull a list of all of the students and store it in an instance variable
    @Student = Student.all
---
SELECT "students".* FROM "students"